In [1]:
import pandas as pd

In [3]:
raw = """customer_id,data_used_gb,calls_made,revenue_inr,region,date
1001,5.2,25,180,Delhi,2025/09/25
1002,,40,280,Mumbai,2025-09-25
1003,7.8,32,210,chennai,25-09-2025
1004,15.6,55,,DELHI,2025-09-25
1005,3.4,18,120,Kolkata,2025-09-25
1005,3.4,18,120,Kolkata,2025-09-25
1006,8.7,52,150,Jabalpur,2025-09-25
1007,5.8,22,135,Bhopal,2025-09-25
1008,6.5,40,180,Gwailor,2025-09-25
1009,11.7,100,350,Indore,2025-09-25
1010,2.5,23,105,Chandigarh,2025-09-25
1011,9.5,50,190,Ambala,2025-09-25
1012,12.1,80,270,Bangalore,2025-09-25
1013,,37,205,Gurgaon,2025-09-25
1014,4.8,43,132,Hyderbad,2025-09-25
"""

In [4]:
open("telecom_usage.csv","w").write(raw)

579

In [5]:
pd.read_csv("telecom_usage.csv").head()

   customer_id  data_used_gb  calls_made  revenue_inr   region        date
0         1001           5.2          25        180.0    Delhi  2025/09/25
1         1002           NaN          40        280.0   Mumbai  2025-09-25
2         1003           7.8          32        210.0  chennai  25-09-2025
3         1004          15.6          55          NaN    DELHI  2025-09-25
4         1005           3.4          18        120.0  Kolkata  2025-09-25

In [6]:
import pandas as pd
df = pd.read_csv("telecom_usage.csv")
print("Original shape:", df.shape)   # (rows, columns)
df.head()

Original shape: (15, 6)

   customer_id  data_used_gb  calls_made  revenue_inr   region        date
0         1001           5.2          25        180.0    Delhi  2025/09/25
1         1002           NaN          40        280.0   Mumbai  2025-09-25
2         1003           7.8          32        210.0  chennai  25-09-2025
3         1004          15.6          55          NaN    DELHI  2025-09-25
4         1005           3.4          18        120.0  Kolkata  2025-09-25

In [8]:
df = pd.read_csv("telecom_usage.csv").head()

In [9]:
df.describe()

       customer_id  data_used_gb  calls_made  revenue_inr
count     5.000000      4.000000     5.00000     4.000000
mean   1003.000000      8.000000    34.00000   197.500000
std       1.581139      5.378971    14.30035    66.520673
min    1001.000000      3.400000    18.00000   120.000000
25%    1002.000000      4.750000    25.00000   165.000000
50%    1003.000000      6.500000    32.00000   195.000000
75%    1004.000000      9.750000    40.00000   227.500000
max    1005.000000     15.600000    55.00000   280.000000

In [10]:
df.head()

   customer_id  data_used_gb  calls_made  revenue_inr   region        date
0         1001           5.2          25        180.0    Delhi  2025/09/25
1         1002           NaN          40        280.0   Mumbai  2025-09-25
2         1003           7.8          32        210.0  chennai  25-09-2025
3         1004          15.6          55          NaN    DELHI  2025-09-25
4         1005           3.4          18        120.0  Kolkata  2025-09-25

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   5 non-null      int64
 1   data_used_gb  4 non-null      float64
 2   calls_made    5 non-null      int64
 3   revenue_inr   4 non-null      float64
 4   region        5 non-null      object
 5   date          5 non-null      object
dtypes: float64(2), int64(2), object(2)
memory usage: 368.0+ bytes

In [12]:
before = len(df)

In [13]:
df.dropna()

   customer_id  data_used_gb  calls_made  revenue_inr   region        date
0         1001           5.2          25        180.0    Delhi  2025/09/25
2         1003           7.8          32        210.0  chennai  25-09-2025
4         1005           3.4          18        120.0  Kolkata  2025-09-25

In [14]:
after = len(df)

In [15]:
# df = df.dropna(subset=["data_used_in_GB","date"])

df.to_csv("missing_telecom_usage.csv", index=False)
print("Saved missing_telecom_usage.csv with", len(df), "rows.")

Saved missing_telecom_usage.csv with 5 rows.

In [16]:
df.head()

   customer_id  data_used_gb  calls_made  revenue_inr   region        date
0         1001           5.2          25        180.0    Delhi  2025/09/25
1         1002           NaN          40        280.0   Mumbai  2025-09-25
2         1003           7.8          32        210.0  chennai  25-09-2025
3         1004          15.6          55          NaN    DELHI  2025-09-25
4         1005           3.4          18        120.0  Kolkata  2025-09-25

In [17]:
df["date"] = pd.to_datetime(df["date"], errors="coerce")  # coerce turns bad dates into NaT
bad_dates = df["date"].isna().sum()
print("Unparseable date rows:", bad_dates)
df = df.dropna(subset=["date"])  # simplest for class

Unparseable date rows: 4

In [18]:
before = len(df)

# Keep the first occurrence of each duplicate and drop the rest
df = df.drop_duplicates(keep='first')

after = len(df)
print(f"Removed {before - after} duplicate rows (kept the first occurrence of each).")

Removed 0 duplicate rows (kept the first occurrence of each).

In [19]:
df.to_csv("cleaned_telecom_usage.csv", index=False)
print("Saved cleaned_telecom_usage.csv with", len(df), "rows.")

Saved cleaned_telecom_usage.csv with 1 rows.

In [20]:
import pandas as pd
pd.set_option('display.max_rows', None)  # show all rows in output
cleaned_df = pd.read_csv("cleaned_telecom_usage.csv")
display(cleaned_df)

   customer_id  data_used_gb  calls_made  revenue_inr region        date
0         1001           5.2          25        180.0  Delhi  2025-09-25